In [ ]:
import pandas as pd

In [34]:
ser=pd.Series(data=[100,200,300,400,500],index=['tom','bob','nancy','dan','eric'])

In [35]:
ser

tom      100
bob      200
nancy    300
dan      400
eric     500
dtype: int64

In [37]:
ser**2

tom       10000
bob       40000
nancy     90000
dan      160000
eric     250000
dtype: int64

ser**3

In [38]:
ser**3

tom        1000000
bob        8000000
nancy     27000000
dan       64000000
eric     125000000
dtype: int64

In [39]:
ser,+200

(tom      100
 bob      200
 nancy    300
 dan      400
 eric     500
 dtype: int64,
 200)

In [40]:
ser+100

tom      200
bob      300
nancy    400
dan      500
eric     600
dtype: int64

In [41]:
ser.index

Index(['tom', 'bob', 'nancy', 'dan', 'eric'], dtype='object')

In [ ]:
ser[[4,3,1]]

In [ ]:
ser[[4,3,2]]

In [ ]:
ser[4]

In [ ]:
ser[3]

In [ ]:
ser['nancy']

In [ ]:
d = {'one' : pd.Series([100., 200., 300.], index=['apple', 'ball', 'clock']),
     'two' : pd.Series([111., 222., 333., 4444.], index=['apple', 'ball', 'cerill', 'dancy'])}

In [42]:
df=pd.DataFrame(d)
print(df)

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [43]:
df.index

Index(['apple', 'ball', 'cerill', 'clock', 'dancy'], dtype='object')

In [44]:
df.columns

Index(['one', 'two'], dtype='object')

In [45]:
pd.DataFrame(d, index=['dancy', 'ball', 'apple'])

         one     two
dancy    NaN  4444.0
ball   200.0   222.0
apple  100.0   111.0

In [46]:
pd.DataFrame(d, index=['dancy', 'ball', 'apple'], columns=['two', 'five'])

          two five
dancy  4444.0  NaN
ball    222.0  NaN
apple   111.0  NaN

# Create DataFrame from list of Python dictionaries

In [47]:
data=[{'a':1,'b':2},{'z':100,'apple':200,'red':300}]
pd.DataFrame(data)

     a    b      z  apple    red
0  1.0  2.0    NaN    NaN    NaN
1  NaN  NaN  100.0  200.0  300.0

In [48]:
data = [{'alex': 1, 'joe': 2}, {'ema': 5, 'dora': 10, 'alice': 20}]

In [49]:
pd.DataFrame(data)

   alex  joe  ema  dora  alice
0   1.0  2.0  NaN   NaN    NaN
1   NaN  NaN  5.0  10.0   20.0

In [50]:
pd.DataFrame(data, index=['orange', 'red'])

        alex  joe  ema  dora  alice
orange   1.0  2.0  NaN   NaN    NaN
red      NaN  NaN  5.0  10.0   20.0

In [51]:
pd.DataFrame(data, columns=['joe', 'dora','alice'])

   joe  dora  alice
0  2.0   NaN    NaN
1  NaN  10.0   20.0

# Basic DataFrame operations

In [52]:
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [53]:
df['one']

apple     100.0
ball      200.0
cerill      NaN
clock     300.0
dancy       NaN
Name: one, dtype: float64

In [54]:
df['three'] = df['one'] * df['two']
df

          one     two    three
apple   100.0   111.0  11100.0
ball    200.0   222.0  44400.0
cerill    NaN   333.0      NaN
clock   300.0     NaN      NaN
dancy     NaN  4444.0      NaN

In [55]:
df['flag'] = df['one'] > 250 # if one>250: store.flag otherwise pass
df

          one     two    three   flag
apple   100.0   111.0  11100.0  False
ball    200.0   222.0  44400.0  False
cerill    NaN   333.0      NaN  False
clock   300.0     NaN      NaN   True
dancy     NaN  4444.0      NaN  False

In [56]:
three

NameError: name 'three' is not defined

In [57]:
df

          one     two    three   flag
apple   100.0   111.0  11100.0  False
ball    200.0   222.0  44400.0  False
cerill    NaN   333.0      NaN  False
clock   300.0     NaN      NaN   True
dancy     NaN  4444.0      NaN  False

In [1]:
del df['two']

NameError: name 'df' is not defined

In [60]:
df

          one    three   flag
apple   100.0  11100.0  False
ball    200.0  44400.0  False
cerill    NaN      NaN  False
clock   300.0      NaN   True
dancy     NaN      NaN  False

In [61]:
df.insert(0,'copy_of_one',df['one'])
df

        copy_of_one    one    three   flag
apple         100.0  100.0  11100.0  False
ball          200.0  200.0  44400.0  False
cerill          NaN    NaN      NaN  False
clock         300.0  300.0      NaN   True
dancy           NaN    NaN      NaN  False

In [ ]:
df['one upper half']=df['one'][:2]
df

# Case Study: Movie Data Analysis

In [31]:
import pandas as pd
movies=pd.read_csv('C:/Users/Hp/Downloads/ds/movies.csv',sep=',')
print(type(movies))
movies.head(10)

<class 'pandas.core.frame.DataFrame'>

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller

In [32]:
import pandas as pd
tags=pd.read_csv('C:/Users/Hp/Downloads/tags.csv',sep=',')
print(type(tags))
tags.head(10)

<class 'pandas.core.frame.DataFrame'>

   userId  movieId                      tag   timestamp
0       3      260                  classic  1439472355
1       3      260                   sci-fi  1439472256
2       4     1732              dark comedy  1573943598
3       4     1732           great dialogue  1573943604
4       4     7569         so bad it's good  1573943455
5       4    44665     unreliable narrators  1573943619
6       4   115569                    tense  1573943077
7       4   115713  artificial intelligence  1573942979
8       4   115713            philosophical  1573943033
9       4   115713                    tense  1573943042

In [ ]:
import pandas as pd
ratings=pd.read_csv('C:/Users/Hp/Downloads/ds/ratings.csv',sep=',')
print(type(ratings))
ratings.head(10)